#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BattlePassPagedTrack

#include "Basic.hpp"


namespace SDK::Params
{

// Function BattlePassPagedTrack.BattlePassPagedTrack_C.CycleTrackBackward
// 0x0008 (0x0008 - 0x0000)
struct BattlePassPagedTrack_C_CycleTrackBackward final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassPagedTrack.BattlePassPagedTrack_C.CycleTrackForward
// 0x0008 (0x0008 - 0x0000)
struct BattlePassPagedTrack_C_CycleTrackForward final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassPagedTrack.BattlePassPagedTrack_C.OnPageChanged
// 0x0001 (0x0001 - 0x0000)
struct BattlePassPagedTrack_C_OnPageChanged final
{
public:
	bool                                          bIsForward;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BattlePassPagedTrack.BattlePassPagedTrack_C.ExecuteUbergraph_BattlePassPagedTrack
// 0x0008 (0x0008 - 0x0000)
struct BattlePassPagedTrack_C_ExecuteUbergraph_BattlePassPagedTrack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsForward;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

